<!-- Шаблон сторінки "Про нас" -->
<template>
    <!-- Головний контейнер з постером -->
    <div class="poster">
        <!-- Зображення для сторінки "Про нас" -->
        <img src="@/assets/img/about-page.svg" class="can-darken" alt="">

        <!-- Контейнер з текстовим контентом -->
        <div class="poster-content">
            <!-- Заголовок сторінки -->
            <h1>Educode</h1>
            <!-- Опис проекту -->
            <p>Це проект для навчання програмуванню, у якому можна вирішувати задачі та тестувати ваші розв'язки завдань - завдяки нашій підтримці понад 20 мов програмування та їх компіляторів. Якщо ви вчитель, то ви можете отримати доступ до створення задач, написавши на email в нижній частині сайту, тоді вам стануть доступні такі функції як створення задач та перегляд розв'язків учнів, що вирішували вашу задачу.</p>
        </div>
    </div>
</template>

<!-- Скриптова частина компонента -->
<script scoped>
export default {
    // Назва компонента
    name: "About"
}
</script>

<!-- Стилі компонента -->
<style lang="scss" scoped>
// Імпорт стилів постера
@import '@/assets/scss/poster.scss';

// Стилізація постера
.poster {
    align-items: center;

    // Налаштування відступів для контенту постера
    div.poster-content {
        margin-top: 0;
    }
}
</style>