<!-- Головна сторінка сайту -->
<template>
    <!-- Головний банер сторінки -->
    <div class="poster">
        <!-- Фонове зображення банера -->
        <img class="can-darken" src="@/assets/img/home-page.svg" alt="">
        <!-- Контент банера -->
        <div class="poster-content">
            <!-- Заголовок -->
            <h1>Програмне забезпечення для навчання</h1>
            <!-- Опис проекту -->
            <p>Це проект для навчання програмуванню, у якому можна вирішувати задачі та тестувати ваші розв'язки завдань - завдяки нашій підтримці понад 20 мов програмування та їх компіляторів. Якщо ви вчитель, то ви можете отримати доступ до створення задач, написавши на email в нижній частині сайту, тоді вам стануть доступні такі функції як створення задач та перегляд розв'язків учнів, що вирішували вашу задачу.</p>
            <!-- Кнопка переходу до задач -->
            <LinkBtn to="/puzzles" anim="go"><i class="fa-solid fa-puzzle-piece"></i> Задачі</LinkBtn>
        </div>
    </div>
</template>

<script scoped>
// Імпорт компонента кнопки-посилання
import LinkBtn from '@/components/LinkBtn.vue';

export default {
    // Назва компонента
    name: "Home",
    // Реєстрація використовуваних компонентів
    components: {LinkBtn}
}
</script>

<!-- Підключення стилів для банера -->
<style lang="scss" src="@/assets/scss/poster.scss" scoped></style>